// ----------------------------------------------------------------------
// 12.15 월요일(15주 1일) - 기말시험(다형성)
// ----------------------------------------------------------------------
// 표준 std::string과 유사한 STRING을 만들어 보며 special 함수들을 알아본다
// ----------------------------------------------------------------------

#include <iostream>
#include <string>
#include "save.h"
#include "STRING.h"
using namespace std;

STRING s;

//--------
int main()
//--------
{
	save("main.cpp");

	STRING s[10]; // trivial - 컴파일러가 이 프로그램은 이미 생성자가 있다고 간주해서 기본 생성자를 호출
}