// ----------------------------------------------------------------------
// 12.15 월요일(15주 1일) - 기말시험(다형성)
// ----------------------------------------------------------------------
// 표준 std::string과 유사한 STRING을 만들어 보며 special 함수들을 알아본다
// ----------------------------------------------------------------------

#include <iostream>
#include <string>
#include "save.h"
#include "STRING.h"
using namespace std;


//--------
int main()
//--------
{
	save("main.cpp");

	STRING s { "2025년 11월 5일 STRING 클래스 파일을 새로 만들었다" };

	cout << "글자 수 - " << s.length() << endl;
	// cout << "글 내용 - " << s << endl;
}