// ----------------------------------------------------------------------
// 12.15 월요일(15주 1일) - 기말시험(다형성)
// ----------------------------------------------------------------------
// 표준 std::string과 유사한 STRING을 만들어 보며 special 함수들을 알아본다
// ----------------------------------------------------------------------

#include <iostream>
#include <string>
#include "save.h"
using namespace std;

//--------
int main()
//--------
{
	save("main.cpp");

	string s { "2025년 11월 3일 클래스의 스페셜 함수를 알아보기 시작한다" };

	cout << "글자 수 - " << s.length() << endl;
	cout << "글 내용 - " << s << endl;
}
