// ----------------------------------------------------------------------
// 12.15 월요일(15주 1일) - 기말시험(다형성)
// ----------------------------------------------------------------------
// 표준 std::string과 유사한 STRING을 만들어 보며 special 함수들을 알아본다
// ----------------------------------------------------------------------

#include <iostream>
#include <string>
#include "save.h"
#include "STRING.h"
using namespace std;

//--------
int main()
//--------
{
	STRING s { "2025. 11. 10" };

	/*
		STACK
		s|--------------------------------
		 | len = 12		|					8 (패딩 4바이트)
		 |--------------------------------
		 | p = 0x00ffab12				 |	8
		 |--------------------------------
		 | id = 1		|					8 (패딩 4바이트)
		 |--------------------------------
			
		 s 위치 : addressof(s) or addressof(s.len)
	*/

	save("main.cpp");
}