//--------------------------------------------------------------------
// 2025. 3-2. 프로그래밍언어, 9월 8일 월요일 (2주 1일)
//--------------------------------------------------------------------
// 자료형과 변수
//--------------------------------------------------------------------

#include <iostream>
#include "save.h"

// int에 저장할 수 있는 값 중에서 가장 큰 값을 저장하라.

//--------
int main()
//--------
{
	long long n = std::numeric_limits<long long>::max(); 
	// long long int, short int 등에서 int 생략 가능

	std::cout << n << '\n';

	save("메인.cpp");
}