//--------------------------------------------------------------------
// 2025. 3-2. 프로그래밍언어, 9월 10일 수요일 (2주 2일)
//--------------------------------------------------------------------
// 자료형과 변수
//--------------------------------------------------------------------

#include <iostream>
#include <bitset>
#include "save.h"

// [실습] 다른 기본 자료형도 지금 한 것과 같이 반복하며 메모리와 친해지자

//--------
int main()
//--------
{
	int n;		// 앞에 token은 자료형(data type)
				// 뒤에 token은 식별자(identifier)라고 한다.

	/*
		int n;
		
		int : 메모리를 sizeof int 만큼 요청
		n  : 요청한 메모리의 시작 주소를 n이라는 이름, 내 마음대로 이름 붙인 식별자이다.

		<Access : Read Access, Write Access>
		==================================================================
		n이라는 이름으로 메모리에 access 할 수 있는 이유는
		컴파일할 때 그 메모리 주소를 결정할 수 있기 때문에 이런 코딩이 가능하다.
		번지수가 n이라는 이름으로 딱 결정되는 것이다.

		폰 노이만 구조 찾아보기.
		==================================================================
	*/

	save("메인.cpp");
}