//--------------------------------------------------------------------
// 변수와 메모리
//--------------------------------------------------------------------

#include <iostream>
#include "save.h"

//--------
int main()
//--------
{
	int n; 

	/*
		ctrl + F5 -> 이름.exe 파일이 폴더에 생성됨 -> 실행(메모리 할당)

		 <메모리>
		|---------------| Low
		| STACK			| <---------- 지역변수 n 저장됨
		|---------------|
		| Free-Store	| <---------- 어떻게 사용? (new, delete)
		|---------------|
		| DATA			| <---------- 전역변수, static 변수 저장됨
		|---------------|
		| TEXT			| <---------- 프로그램 코드 (ex Main 함수) 저장됨
		|---------------| High

	*/

	save("메인.cpp");
}