//--------------------------------------------------------------------
// 2025. 3-2. 프로그래밍언어, 9월 10일 수요일 (2주 2일)
//--------------------------------------------------------------------
// 자료형과 변수
//--------------------------------------------------------------------

#include <iostream>
#include "save.h"

// [문제] int값 2개를 입력받아 합계를 알려주는 함수 add를 작성하라.
// 다음 main이 문제없이 실행되어야 한다.
int add(int a, int b)
{
	return a + b;
}

//--------
int main()
//--------
{
	std::cout << "합계를 알려줍니다" << '\n';
	std::cout << "int값 2개를 입력하세요: ";
	int a, b;
	std::cin >> a >> b;
	std::cout << a << " + " << b << " = " << add(a, b) << '\n';

	save("메인.cpp");
}