//--------------------------------------------------------------------
// 변수와 메모리
//--------------------------------------------------------------------

#include <iostream>
#include "save.h"

// [문제] 프로그램 실행 중에 STACK을 넘치게 해보세요. -> recursive function call

int cnt { 0 };

int f();

int f()
{
	int n[250'000] { 20250922 }; // 1MB

	std::cout << "f 호출 횟수 - " << ++cnt << ", -> " << n[0] << "\n";

	f(); // 재귀호출 - recursive call

	return 20250922;
}

//--------
int main()		
//--------
{
	save("메인.cpp");
	f();

	//save("메인.cpp");
}