//--------------------------------------------------------------------
// 2025. 3-2. 프로그래밍언어, 9월 10일 수요일 (2주 2일)
//--------------------------------------------------------------------
// 자료형과 변수
//--------------------------------------------------------------------

#include <iostream>
#include <bitset>
#include "save.h"

// [실습] 다른 기본 자료형도 지금 한 것과 같이 반복하며 메모리와 친해지자

//--------
int main()
//--------
{
	int n;		// 앞에 token은 자료형(data type)
				// 뒤에 token은 식별자(identifier)라고 한다.

	save("메인.cpp");
}